Revit 2015 API
CompoundStructureLayer.DeckEmbeddingType Property
 Embedding type for structural deck - only for a layer whose function is StructuralDeck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public StructDeckEmbeddingType DeckEmbeddingType { get; set; }
Visual Basic
Public Property DeckEmbeddingType As StructDeckEmbeddingType
	Get
	Set
Visual C++
public:
property StructDeckEmbeddingType DeckEmbeddingType {
	StructDeckEmbeddingType get ();
	void set (StructDeckEmbeddingType value);
}
Field Value
 The default is Invalid.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace